package com.example.bigtripbalan;

import android.content.Intent;
import android.os.Bundle;
import android.view.View;
import android.widget.Button;
import android.widget.ImageView;
import android.widget.RadioButton;
import android.widget.TextView;

import androidx.annotation.Nullable;
import androidx.appcompat.app.AppCompatActivity;

public class TurActivity extends AppCompatActivity {
    TextView tw26;
    TextView tw25;
    TextView tw27;
    TextView tw28;
    TextView tw29;
    TextView tw30;
    TextView tw31;

    RadioButton rb15;
    RadioButton rb16;
    RadioButton rb17;
    ImageView im7;
    Button bt22;
    Button bt23;
    String rez;
    int den2;


    @Override
    protected void onCreate(@Nullable Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_tur);
        rb17=(RadioButton)findViewById(R.id.rb17) ;
        rb16=(RadioButton) findViewById(R.id.rb16);
        rb15=(RadioButton)findViewById(R.id.rb15);
        bt22=(Button) findViewById(R.id.bt22);
        bt23=(Button) findViewById(R.id.bt23);

        im7=(ImageView)findViewById(R.id.im7);
        tw26=(TextView)findViewById(R.id.tw26);
        tw25=(TextView)findViewById(R.id.tw25);
        tw27=(TextView)findViewById(R.id.tw27);
        tw28=(TextView)findViewById(R.id.tw28);
        tw29=(TextView)findViewById(R.id.tw29);
        tw30=(TextView)findViewById(R.id.tw30);
        tw31=(TextView)findViewById(R.id.tw31);


        bt22.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                den2=0;
                rb15.setEnabled(true);
                rb16.setEnabled(true);
                rb17.setEnabled(true);
            }
        });

        Bundle arguments=getIntent().getExtras();
         rez=arguments.get("city").toString();

        bt23.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(TurActivity.this, GolovnActivity.class);
                startActivity(intent);
            }
        });

        if(rez.equals("3")){
            im7.setImageResource(R.drawable.rm2);
            tw31.setText("Рим");
        } else  if(rez.equals("1")){
            im7.setImageResource(R.drawable.mdr2);
            tw31.setText("Мадрид");
        } else  if(rez.equals("2")){
            im7.setImageResource(R.drawable.amst2);
            tw31.setText("Амстердам");

        }

    }

    public void onClickChacked(View view) {
        switch (view.getId()) {
            case R.id.rb15:
                rb16.setEnabled(false);
                rb17.setEnabled(false);
                if(rez.equals("3")){

                    tw25.setText("1 день. Угорщина. Виїзд з Івано-Франківська. Ввечері приїжаєм у  Будапешт. Оглядова екскурсія (включена у вартість). Річкова прогулянка  на кораблику 26€. Нічний переїзд.");
                    tw26.setText("2 день. Верона. Сніданок у готелі. Оглядова екскурсія(включена у вартість). Вільний час або додаткові екскурсії( Озеро Гарда 38/30€. Соаве, долини і вино 38/30€. Гардаленд, парк атракціонів 23€ + вхідний квиток ).");
                    tw27.setText("3 день. Сніданок. Екскурсії або вільний час. Ввечері від'їзд в Україну.");
                    tw28.setText("4 день. Приїзд в Івано-Франківськ");
                } else if(rez.equals("1")){
                    tw25.setText("1 день. Угорщина. Виїзд з Івано-Франківська ввечері. Зранку приїжаєм у  Будапешт. Оглядова екскурсія (включена у вартість). Річкова прогулянка  на кораблику 26€. Денний переїзд.");
                    tw26.setText("2 день. Приїжаєм у Верону. Сніданок у готелі. Оглядова екскурсія(включена у вартість). Вільний час або додаткові екскурсії( Озеро Гарда 38/30€. Соаве, долини і вино 38/30€. Гардаленд, парк атракціонів 23€ + вхідний квиток ).Нічний переїзд.");
                    tw27.setText("3 день. Приїзд у Мадрид. Сніданок. Екскурсії або вільний час(Захоплюючий мадрид 30/25€. Поселення");
                    tw28.setText("4 день. Зранку відїзд в Україну");
                } else if(rez.equals("2")){

                 tw25.setText("1 день. Угорщина. Виїзд з Івано-Франківська ввечері. Зранку приїжаєм у  Будапешт. Оглядова екскурсія (включена у вартість). Річкова прогулянка  на кораблику 26€. Нічний переїзд.");
                 tw26.setText("2 день. Приїжаєм у Верону. Сніданок у готелі. Оглядова екскурсія(включена у вартість). Вільний час або додаткові екскурсії( Озеро Гарда 38/30€. Соаве, долини і вино 38/30€. Гардаленд, парк атракціонів 23€ + вхідний квиток ).Нічний переїзд.");
                 tw27.setText("3 день. Приїзд у Амстердам. Сніданок. Екскурсії або вільний час(Голандські тюльпанчики 50/45€.Zaanse Schans 30/25 €). Поселення");
                 tw28.setText("4 день. Зранку відїзд в Україну");
            }

            break;

            case R.id.rb16:
                rb15.setEnabled(false);
                rb17.setEnabled(false);
                if(rez.equals("3")){

                    tw25.setText("1 день. Угорщина. Виїзд з Івано-Франківська зранку. Ввечері приїжаєм у  Будапешт. Оглядова екскурсія (включена у вартість). Річкова прогулянка  на кораблику 26€. Нічний переїзд.");
                    tw26.setText( "2 день. Верона. Сніданок у готелі. Оглядова екскурсія(включена у вартість). Вільний час або додаткові екскурсії( Озеро Гарда 38/30€. Соаве, долини і вино 38/30€. Гардаленд, парк атракціонів 23€ + вхідний квиток ).\n" +
                            "Відпочинок на території Італії ");
                    tw27.setText("3 день. Приїзд у Рим. Оглядова екскурсія(включена у вартість). Додаткові екскурсії або вільний час(Стародавній Рим + Колізей, 23€ + вхідний квиток. Трастевере 21/16€).Екскурсія по вечірньому Риму(включена у вартість). Приїзд  у готель. Відпочинок. ");
                    tw28.setText("4 день. Сніданок. Екскурсії або вільний час. В обід  від'їзд в Україну.");
                    tw29.setText("5 день. Приїзд в Івано-Франківськ");

                } else if(rez.equals("1")){
                    tw25.setText("1 день. Угорщина. Виїзд з Івано-Франківська ввечері. Зранку приїжаєм у  Будапешт. Оглядова екскурсія (включена у вартість). Річкова прогулянка  на кораблику 26€. Денний переїзд.");
                    tw26.setText("2 день. Приїжаєм у Верону. Сніданок у готелі. Оглядова екскурсія(включена у вартість). Вільний час або додаткові екскурсії( Озеро Гарда 38/30€. Соаве, долини і вино 38/30€. Гардаленд, парк атракціонів 23€ + вхідний квиток ).Поселення.");
                    tw27.setText("3 день. Сніданок. Приїзд у Мадрид. Сніданок. Екскурсії або вільний час(Таємниці Мадридського двору 30/25€). Поселення");
                    tw28.setText("4 день. Сніданок. Переїзд в Барселону. Екскурсії або вільний час(Захоплюючий мадрид 30/25€)");
                    tw29.setText("5 день. Сніданок. Виїзд о 6.00.Приїзд в Івано-Франківськ");

                } else if(rez.equals("2")){
                    tw25.setText("1 день. Угорщина. Виїзд з Івано-Франківська ввечері. Зранку приїжаєм у  Будапешт. Оглядова екскурсія (включена у вартість). Річкова прогулянка  на кораблику 26€. Нічний переїзд.");
                    tw26.setText("2 день. Приїжаєм у Верону. Сніданок у готелі. Оглядова екскурсія(включена у вартість). Вільний час або додаткові екскурсії( Озеро Гарда 38/30€. Соаве, долини і вино 38/30€. Гардаленд, парк атракціонів 23€ + вхідний квиток ).Нічний переїзд.");
                    tw27.setText("3 день. Приїзд у Амстердам. Сніданок. Екскурсії або вільний час(Голандські тюльпанчики 50/45€). Поселення");
                    tw28.setText("4 день. Сніданок. Екскурсії або вільний час(Замок Каркасон 30/25 €). Поселення.");
                    tw29.setText("5 день. Сніданок. Виїзд о 6.00. Приїзд в Івано-Франківськ");
                }

                break;

            case R.id.rb17:
                rb16.setEnabled(false);
                rb15.setEnabled(false);
                if(rez.equals("3")){
                    tw25.setText("1 день. Угорщина. Виїзд з Івано-Франківська зранку. Ввечері приїжаєм у  Будапешт. Оглядова екскурсія (включена у вартість). Річкова прогулянка  на кораблику 26€. Нічний переїзд.");
                    tw26.setText( "Верона. Сніданок у готелі. Оглядова екскурсія(включена у вартість). Вільний час або додаткові екскурсії( Озеро Гарда 38/30€. Соаве, долини і вино 38/30€. Гардаленд, парк атракціонів 23€ + вхідний квиток ).\n" +
                            "Відпочинок на території Італії ");
                    tw27.setText("3 день. Приїзд у Рим. Оглядова екскурсія(включена у вартість). Додаткові екскурсії або вільний час(Стародавній Рим + Колізей, 23€ + вхідний квиток. Трастевере 21/16€).Екскурсія по вечірньому Риму(включена у вартість). Приїзд  у готель. Відпочинок. ");
                    tw28.setText("4 день. Сніданок. Екскурсії або вільний час. В обід від'їзд в Сан-Марино.");
                    tw29.setText("5 день. Сан-Марино. Оглядова екскурсія(включена у вартість). Додаткові екскурсії або вільний час(Болонья 23/18€ . Падуя 23/18€). Приїзд  у готель. Відпочинок. ");
                    tw30.setText("6 день. Приїзд в Івано-Франківськ");


                } else if(rez.equals("1")){
                    tw25.setText("1 день. Угорщина. Виїзд з Івано-Франківська ввечері. Зранку приїжаєм у  Будапешт. Оглядова екскурсія (включена у вартість). Річкова прогулянка  на кораблику 26€. Денний переїзд.");
                    tw26.setText("2 день. Приїжаєм у Верону. Сніданок у готелі. Оглядова екскурсія(включена у вартість). Вільний час або додаткові екскурсії( Озеро Гарда 38/30€. Соаве, долини і вино 38/30€. Гардаленд, парк атракціонів 23€ + вхідний квиток ).Поселення.");
                    tw27.setText("3 день. Сніданок. Приїзд у Мадрид. Сніданок. Екскурсії або вільний час(Таємниці Мадридського двору 30/25€). Поселення");
                    tw28.setText("4 день. Сніданок. Переїзд в Барселону. Екскурсії або вільний час(Захоплюючий мадрид 30/25€)");
                    tw29.setText("5 день. Сніданок. Переїзд у Валенсію. Екскурсії або вільний час(Середньовікова іспанія. Теруель і Альбарасин  40/35€). Нічний переїзд");
                    tw30.setText("6 день. Приїзд в Івано-Франківськ");

                } else if(rez.equals("2")){
                    tw25.setText("1 день. Угорщина. Виїзд з Івано-Франківська ввечері. Зранку приїжаєм у  Будапешт. Оглядова екскурсія (включена у вартість). Річкова прогулянка  на кораблику 26€. Нічний переїзд.");
                    tw26.setText("2 день. Приїжаєм у Верону. Сніданок у готелі. Оглядова екскурсія(включена у вартість). Вільний час або додаткові екскурсії( Озеро Гарда 38/30€. Соаве, долини і вино 38/30€. Гардаленд, парк атракціонів 23€ + вхідний квиток ).Нічний переїзд.");
                    tw27.setText("3 день. Приїзд у Амстердам. Сніданок. Екскурсії або вільний час(Голандські тюльпанчики 50/45€). Поселення");
                    tw28.setText("4 день. Сніданок. Екскурсії або вільний час(Замок Каркасон 30/25 €). Поселення.");
                    tw29.setText("5 день. Сніданок. Переїзд в Брно. Екскурсії або вільний час(Таємниці Брно 20/15€). Нічний переїзд");
                    tw30.setText("6 день. Приїзд в Івано-Франківськ");
                }


                break;
        }

    }
}
